In [1]:
import wrangle_mall as wm

In [2]:
df_mall=wm.get_mallcustomer_data()
df_mall.head()

             gender  age  annual_income  spending_score
customer_id
1              Male   19             15              39
2              Male   21             15              81
3            Female   20             16               6
4            Female   23             16              77
5            Female   31             17              40

In [3]:
wm.df_summary(df_mall)

--- Shape: (200, 4)
--- Info
<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 1 to 200
Data columns (total 4 columns):
gender            200 non-null object
age               200 non-null int64
annual_income     200 non-null int64
spending_score    200 non-null int64
dtypes: int64(3), object(1)
memory usage: 7.8+ KB
--- Descriptions
        gender         age  annual_income  spending_score
count      200  200.000000     200.000000      200.000000
unique       2         NaN            NaN             NaN
top     Female         NaN            NaN             NaN
freq       112         NaN            NaN             NaN
mean       NaN   38.850000      60.560000       50.200000
std        NaN   13.969007      26.264721       25.823522
min        NaN   18.000000      15.000000        1.000000
25%        NaN   28.750000      41.500000       34.750000
50%        NaN   36.000000      61.500000       50.000000
75%        NaN   49.000000      78.000000       73.000000
max        NaN   70.000000     137.000000       99.000000
--- Nulls By Column
                num_rows_missing  pct_rows_missing
gender                         0               0.0
age                            0               0.0
annual_income                  0               0.0
spending_score                 0               0.0
--- Nulls By Row
  num_cols_missing pct_cols_missing  customer_id
0                0              0.0          200
--- Value Counts
Female            112
Male               88
(17.947, 23.2]     31
(23.2, 28.4]       19
(28.4, 33.6]       34
(33.6, 38.8]       29
(38.8, 44.0]       18
(44.0, 49.2]       24
(49.2, 54.4]       15
(54.4, 59.6]       10
(59.6, 64.8]        6
(64.8, 70.0]       14
(14.877, 27.2]     24
(27.2, 39.4]       22
(39.4, 51.6]       28
(51.6, 63.8]       38
(63.8, 76.0]       32
(76.0, 88.2]       34
(88.2, 100.4]       8
(100.4, 112.6]      6
(112.6, 124.8]      4
(124.8, 137.0]      4
(0.901, 10.8]      16
(10.8, 20.6]       20
(20.6, 30.4]       10
(30.4, 40.2]       17
(40.2, 50.0]       40
(50.0, 59.8]       32
(59.8, 69.6]       11
(69.6, 79.4]       24
(79.4, 89.2]       14
(89.2, 99.0]       16
dtype: int64

In [4]:
k=1.5
df=df_mall
df_mall = wm.add_outlier_columns(df, k)
df_mall.head()

,gender,age,annual_income,spending_score,age_outliers,annual_income_outliers,spending_score_outliers
customer_id,,,,,,,
1,Male,19,15,39,0,0.0,0
2,Male,21,15,81,0,0.0,0
3,Female,20,16,6,0,0.0,0
4,Female,23,16,77,0,0.0,0
5,Female,31,17,40,0,0.0,0

In [5]:
df_mall.shape

(200, 7)

In [6]:
df = df_mall
test, train = wm.split(df,train_pct=.7)

In [7]:
test.shape

(60, 7)

In [8]:
train.shape

(140, 7)

In [9]:
col_name = 'gender'
test, train, = wm.one_hot_encode(train, test, col_name)
test.drop(columns='gender',inplace=True)
train.drop(columns='gender',inplace=True)

In [10]:
train.head()

,age,annual_income,spending_score,age_outliers,annual_income_outliers,spending_score_outliers,Female,Male
customer_id,,,,,,,,
43,48,39,36,0,0.0,0,0.0,1.0
192,32,103,69,0,0.0,0,1.0,0.0
27,45,28,32,0,0.0,0,1.0,0.0
45,49,39,28,0,0.0,0,1.0,0.0
42,24,38,92,0,0.0,0,0.0,1.0

In [11]:
wm.nulls_by_col(train)

                         num_rows_missing  pct_rows_missing
age                                     0               0.0
annual_income                           0               0.0
spending_score                          0               0.0
age_outliers                            0               0.0
annual_income_outliers                  0               0.0
spending_score_outliers                 0               0.0
Female                                  0               0.0
Male                                    0               0.0

In [12]:
wm.nulls_by_col(test)

                         num_rows_missing  pct_rows_missing
age                                     0               0.0
annual_income                           0               0.0
spending_score                          0               0.0
age_outliers                            0               0.0
annual_income_outliers                  0               0.0
spending_score_outliers                 0               0.0
Female                                  0               0.0
Male                                    0               0.0

In [13]:
train_scaled, test_scaled, scaler = wm.standard_scaler(train,test)

In [14]:
train_scaled.head()

,age,annual_income,spending_score,age_outliers,annual_income_outliers,spending_score_outliers,Female,Male
43,0.731840,-0.814526,-0.599688,0.0,-0.084819,0.0,-1.154701,1.154701
192,-0.444988,1.583028,0.672378,0.0,-0.084819,0.0,0.866025,-0.866025
27,0.511185,-1.226606,-0.753878,0.0,-0.084819,0.0,0.866025,-0.866025
45,0.805392,-0.814526,-0.908068,0.0,-0.084819,0.0,0.866025,-0.866025
42,-1.033403,-0.851988,1.558970,0.0,-0.084819,0.0,-1.154701,1.154701

In [15]:
scaler

StandardScaler(copy=True, with_mean=True, with_std=True)

In [16]:
train_scaled, test_scaled, scaler = wm.mall_clean()

In [18]:
train_scaled.head()

,age,annual_income,spending_score,age_outliers,annual_income_outliers,spending_score_outliers,Female,Male
43,0.731840,-0.814526,-0.599688,0.0,-0.084819,0.0,-1.154701,1.154701
192,-0.444988,1.583028,0.672378,0.0,-0.084819,0.0,0.866025,-0.866025
27,0.511185,-1.226606,-0.753878,0.0,-0.084819,0.0,0.866025,-0.866025
45,0.805392,-0.814526,-0.908068,0.0,-0.084819,0.0,0.866025,-0.866025
42,-1.033403,-0.851988,1.558970,0.0,-0.084819,0.0,-1.154701,1.154701